tutorials/cfdemSolverRhoPimpleChem/Unreacted_Shrinking_Core_Test_Case/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1.33e-4 0 0);	

boundaryField
{
    top
    {
	type		noSlip;
/*        type            fixedValue;
        value           uniform (0.0 0 0);*/ 
    }
    bottom
    {
	type		noSlip;
/*        type            fixedValue;
        value           uniform (0.0 0 0);*/
    }
    side-walls
    {
	type		noSlip;
/*        type            fixedValue;
        value           uniform (0.0 0 0);	*/
    }
    inlet
    {
        type            fixedValue;
        value           uniform (1.33e-4 0 0); 
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
