tutorials/cfdemSolverRhoPimpleChem/Unreacted_Shrinking_Core_Test_Case/CFD/constant/foam.inp
species
(
        CO
        CO2
	O2
	N2
);

reactions
{
}


