tutorials/cfdemSolverRhoPimpleChem/Unreacted_Shrinking_Core_Test_Case/CFD/system/probesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.1.x                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		2.0;
	format		ascii;
	class		dictionary;
	object		probesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



fields
(
    rho
    p
    T
    molC
    O2
    CO2
    CO
    ModSpeciesMassField_O2
    ModSpeciesMassField_CO2
    ModSpeciesMassField_CO
	X_CO
	X_CO2
);

writeControl   timeStep;
writeInterval  10;


// Locations to be probed.
probeLocations
(
	(7.0 2.5 2.5)
        (8.0 2.5 2.5)
        (1.0 2.5 2.5)
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
